config/InformationRegisters/ПрайсЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПрайсЛисты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПолное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПоставщикСвязки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПриведенная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БарКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВСпайке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВКоробе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхЦенаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КодПрайсЛиста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/AccumulationRegisters/УЗ_Партии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_Партии</Name>
			<Comment>Хороший товар. Регистр на кодах справочников.</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗакупБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПартияКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТоварКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФирмаКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПоступленияПорядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДСЗакуп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/Documents/ТайныйПокупатель_ДанныеДляВозврата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ТайныйПокупатель_ДанныеДляВозврата</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШтрихкодПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсуществленВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/Catalogs/СвязкиТовараСПоставщиком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СвязкиТовараСПоставщиком</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТовараПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварФирмы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блокировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТовараПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/WebServices/mystery/Ext/Module.bsl
Функция mystery_shopper_check(prt_bc, summa, inn, no_check)
	
	
	Если summa>5000 ТОгда
		Возврат "ERR: Слишком большая сумма покупки!";
	КонецЕсли;	
	
	Запрос=Новый запрос();

	
	Если no_check=Ложь Тогда
		
		СтрИНН= Прав(СокрЛП(inn),10);
		
		Запрос.Текст="ВЫБРАТЬ
		|	Фирмы.Ссылка как Фирма
		|ИЗ
		|	Справочник.Фирмы КАК Фирмы
		|ГДЕ
		|	Фирмы.ИНН = &ИНН";
		
		
		Запрос.УстановитьПараметр("ИНН",СтрИНН);
		Рез=Запрос.Выполнить();
		
		Если Рез.Пустой() Тогда
			Возврат "ERR: Нет фирмы с ИНН "+inn+" ! Это чужой чек!";
		КонецЕсли;
		
		
		Выб=Рез.Выбрать();
		Пока Выб.Следующий() Цикл
			Фирма=Выб.Фирма;
		КонецЦикла;	
		
		
		
		
		
		Если СтрДлина(СокрЛП(prt_bc))<>13 Тогда
			Возврат "ERR: Неверная длина штрихкода партии! Должно быть 13 цифр!";
		Конецесли; 	 
		
		
		Если Лев(СокрЛП(prt_bc),2)<>"24" Тогда
			Возврат "ERR: Это не штрихкод партии! Штрихкод партии должен начинаться с 24 ";
		КонецЕсли;	 
		
		ПравильныйШК=ВычислитьКонтрольнуюСумму(Лев(СокрЛП(prt_bc),12));
		
		Если СокрЛП(prt_bc)<>ПравильныйШК Тогда 
			Возврат "ERR: Ошибка при вводе штрихкода партии!";
		Конецесли;	
		
		ЧисловойКодПартии=Число(Сред(СокрЛП(prt_bc),3,10));
		
		
		Запрос.Текст="ВЫБРАТЬ
		|	УЗ_Партии.Ссылка КАК Партия,
		|	АССОРТИМЕНТНЫЙ_ПЛАН.Ссылка КАК Товар
		|ИЗ
		|	Справочник.УЗ_Партии КАК УЗ_Партии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АССОРТИМЕНТНЫЙ_ПЛАН КАК АССОРТИМЕНТНЫЙ_ПЛАН
		|		ПО УЗ_Партии.КодТовара = АССОРТИМЕНТНЫЙ_ПЛАН.Код
		|ГДЕ
		|	УЗ_Партии.Код = &Код";
		
		Запрос.УстановитьПараметр("Код",ЧисловойКодПартии);
		
		Рез=Запрос.Выполнить();
		
		Если Рез.Пустой() Тогда
			Возврат "ERR: Такой партии не существует!";
		КонецЕсли;	
		
		Выб=Рез.Выбрать();
		Пока Выб.Следующий() Цикл
			Товар=Выб.Товар;
		КонецЦикла;	
		
	Иначе
		// Ввод товара без чека. Код партии неизвестен, но есть баркод на товаре
		
		КодАптеки=Число(СокрЛП(inn));
		
		Запрос.Текст="ВЫБРАТЬ
		|	МестаХранения.Ссылка,
		|	МестаХранения.Код,
		|	МестаХранения.Фирма,
		|	МестаХранения.Фирма.ИНН как ИНН
		|ИЗ
		|	Справочник.МестаХранения КАК МестаХранения
		|ГДЕ
		|	МестаХранения.Код = &Код";
		
		Запрос.УстановитьПараметр("Код",КодАптеки );
		
		Рез=Запрос.Выполнить();
		
		Если Рез.Пустой() Тогда
			Возврат "ERR: Нет аптеки с кодом "+Формат(КодАптеки,"ЧГ=0");
		КонецЕсли;
		
		Выб=Рез.Выбрать();
		Выб.Следующий();
		
		Фирма=Выб.Фирма;
		СтрИНН=Выб.ИНН;
		
		
		
		Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 10
		|	ПрайсЛисты.Код КАК Код,
		|	ПрайсЛисты.ПоставщикСвязки КАК ПоставщикСвязки
		|ПОМЕСТИТЬ Кандидаты
		|ИЗ
		|	РегистрСведений.ПрайсЛисты КАК ПрайсЛисты
		|ГДЕ
		|	ПрайсЛисты.БарКод = &БарКод
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Код,
		|	ПоставщикСвязки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	СвязкиТовараСПоставщиком.ТоварФирмы,
		|	СУММА(1) КАК Поле1,
		|	СвязкиТовараСПоставщиком.ТоварФирмы.Код  как КодТовара
		|ИЗ
		|	Справочник.СвязкиТовараСПоставщиком КАК СвязкиТовараСПоставщиком
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Кандидаты КАК Кандидаты
		|		ПО СвязкиТовараСПоставщиком.Поставщик = Кандидаты.ПоставщикСвязки
		|			И СвязкиТовараСПоставщиком.КодТовараПоставщика = Кандидаты.Код
		|
		|СГРУППИРОВАТЬ ПО
		|	СвязкиТовараСПоставщиком.ТоварФирмы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Поле1 УБЫВ";
		
		Запрос.УстановитьПараметр("БарКод",СокрЛП(prt_bc));			 
		Рез=Запрос.Выполнить();		
		
		Если Рез.Пустой() Тогда
			Возврат "ERR: Не найден товар с баркодом "+СокрЛП(prt_bc);
		КонецЕсли;	
		
		Выб=Рез.Выбрать();
		Выб.Следующий();  // 1 строка
		
		Товар=Выб.ТоварФирмы;
		КодТовара=Выб.КодТовара;
		
		Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		|	УЗ_ПартииОстатки.ПартияКод КАК ПартияКод,
		|	УЗ_ПартииОстатки.ТоварКод,
		|	УЗ_ПартииОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА УЗ_ПартииОстатки.КоличествоОстаток <= 0
		|			ТОГДА 10000000000000
		|		ИНАЧЕ УЗ_ПартииОстатки.КоличествоОстаток
		|	КОНЕЦ КАК Поле1
		|ПОМЕСТИТЬ партия
		|ИЗ
		|	РегистрНакопления.УЗ_Партии.Остатки(
		|			,
		|			ТоварКод = &ТоварКод
		|				И СкладКод = &СкладКод) КАК УЗ_ПартииОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоличествоОстаток,
		|	ПартияКод УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	
		|	УЗ_Партии.Наименование
		|ИЗ
		|	партия КАК партия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УЗ_Партии КАК УЗ_Партии
		|		ПО партия.ПартияКод = УЗ_Партии.Код";
		
		Запрос.УстановитьПараметр("ТоварКод",КодТовара);			 
		Запрос.УстановитьПараметр("СкладКод",КодАптеки);
		
		Рез=Запрос.Выполнить();
		
		Если Рез.Пустой() Тогда
			Возврат "ERR: На указанной аптеке не найдена подходящая партия товара.";
		КонецЕсли;
		
		Выб=Рез.Выбрать();
		Выб.Следующий();
		
		
		prt_bc=Выб.Наименование;
		
		
	Конецесли;
	
	Док=Документы.ТайныйПокупатель_ДанныеДляВозврата.СоздатьДокумент();
	
	Док.БезЧека=no_check;
	Док.Дата=ТекущаяДата();
	Док.ИНН=СтрИНН;
	Док.Сумма=summa;
	Док.ШтрихкодПартии=prt_bc;
	Док.Товар=Товар;
	Док.Фирма=Фирма;
	
	Док.Записать();
	
	Возврат "ok";
КонецФункции
